CRUD-general-purpose/ranking_batch-0_apache-cassandra-400-vanilla-os-small-medium-msazure-2022_0_h5h1jYo4/0_load.txt
/usr/java/bin/java -XX:MaxRAMPercentage=85.0 -cp /binary/ycsb/cassandra-binding/conf:/binary/ycsb/conf:/binary/ycsb/lib/HdrHistogram-2.1.4.jar:/binary/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/binary/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/binary/ycsb/lib/jackson-core-asl-1.9.4.jar:/binary/ycsb/lib/core-0.17.0.jar:/binary/ycsb/cassandra-binding/lib/netty-handler-4.0.33.Final.jar:/binary/ycsb/cassandra-binding/lib/cassandra-driver-core-3.0.0.jar:/binary/ycsb/cassandra-binding/lib/netty-common-4.0.33.Final.jar:/binary/ycsb/cassandra-binding/lib/guava-16.0.1.jar:/binary/ycsb/cassandra-binding/lib/metrics-core-3.1.2.jar:/binary/ycsb/cassandra-binding/lib/netty-codec-4.0.33.Final.jar:/binary/ycsb/cassandra-binding/lib/netty-buffer-4.0.33.Final.jar:/binary/ycsb/cassandra-binding/lib/cassandra-binding-0.17.0.jar:/binary/ycsb/cassandra-binding/lib/netty-transport-4.0.33.Final.jar:/binary/ycsb/cassandra-binding/lib/slf4j-api-1.7.25.jar site.ycsb.Client -db site.ycsb.db.CassandraCQLClient -s -p hosts=10.10.0.4 -p cassandra.keyspace=ycsb -target 25000 -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
Command line: -db site.ycsb.db.CassandraCQLClient -s -p hosts=10.10.0.4 -p cassandra.keyspace=ycsb -target 25000 -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
YCSB Client 0.17.0

Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
2022-04-27 06:58:15:010 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2022-04-27 06:58:24:971 10 sec: 237648 operations; 23764.8 current ops/sec; est completion in 3 minutes [INSERT: Count=237691, Max=162431, Min=271, Avg=2854.66, 90=6067, 99=15479, 99.9=49343, 99.99=150655] 
2022-04-27 06:58:34:970 20 sec: 484828 operations; 24718 current ops/sec; est completion in 3 minutes [INSERT: Count=247137, Max=488191, Min=273, Avg=1916.92, 90=3989, 99=8455, 99.9=16591, 99.99=487423] 
2022-04-27 06:58:44:970 30 sec: 737646 operations; 25281.8 current ops/sec; est completion in 2 minutes [INSERT: Count=252818, Max=996351, Min=254, Avg=2071.58, 90=3091, 99=6947, 99.9=26351, 99.99=887295] 
2022-04-27 06:58:54:970 40 sec: 975903 operations; 23825.7 current ops/sec; est completion in 2 minutes [INSERT: Count=238271, Max=633855, Min=269, Avg=1396.93, 90=2889, 99=7647, 99.9=12471, 99.99=633343] 
2022-04-27 06:59:04:970 50 sec: 1237514 operations; 26161.1 current ops/sec; est completion in 2 minutes [INSERT: Count=261607, Max=30191, Min=274, Avg=1272.05, 90=3037, 99=8171, 99.9=13471, 99.99=19231] 
2022-04-27 06:59:14:970 60 sec: 1487684 operations; 25017 current ops/sec; est completion in 2 minutes [INSERT: Count=250166, Max=632319, Min=271, Avg=1324.07, 90=2571, 99=6695, 99.9=10935, 99.99=630783] 
2022-04-27 06:59:24:970 70 sec: 1737686 operations; 25000.2 current ops/sec; est completion in 2 minutes [INSERT: Count=250004, Max=634367, Min=275, Avg=2178.53, 90=3939, 99=9279, 99.9=27407, 99.99=631295] 
2022-04-27 06:59:34:970 80 sec: 1962438 operations; 22475.2 current ops/sec; est completion in 2 minutes [INSERT: Count=224744, Max=1190911, Min=283, Avg=3497.43, 90=4443, 99=8951, 99.9=328959, 99.99=1107967] 
2022-04-27 06:59:44:970 90 sec: 2219132 operations; 25669.4 current ops/sec; est completion in 1 minute [INSERT: Count=256694, Max=532479, Min=274, Avg=2975.08, 90=3799, 99=8287, 99.9=348415, 99.99=450559] 
2022-04-27 06:59:54:970 100 sec: 2487652 operations; 26852 current ops/sec; est completion in 1 minute [INSERT: Count=268532, Max=1487871, Min=276, Avg=3104.97, 90=4045, 99=8839, 99.9=400383, 99.99=1108991] 
2022-04-27 07:00:04:970 110 sec: 2733829 operations; 24617.7 current ops/sec; est completion in 1 minute [INSERT: Count=246196, Max=651775, Min=255, Avg=1512.54, 90=2789, 99=7047, 99.9=16735, 99.99=648703] 
2022-04-27 07:00:14:970 120 sec: 2987684 operations; 25385.5 current ops/sec; est completion in 1 minute [INSERT: Count=253830, Max=23375, Min=264, Avg=919.61, 90=2157, 99=6523, 99.9=9879, 99.99=17167] 
2022-04-27 07:00:24:971 130 sec: 3223612 operations; 23592.8 current ops/sec; est completion in 1 minute [INSERT: Count=235924, Max=783359, Min=281, Avg=3631.04, 90=4731, 99=8895, 99.9=561663, 99.99=679423] 
2022-04-27 07:00:34:970 140 sec: 3487683 operations; 26407.1 current ops/sec; est completion in 1 minute [INSERT: Count=264079, Max=562175, Min=276, Avg=3558.1, 90=4727, 99=9063, 99.9=19087, 99.99=463359] 
2022-04-27 07:00:44:970 150 sec: 3697558 operations; 20987.5 current ops/sec; est completion in 53 seconds [INSERT: Count=209901, Max=913919, Min=291, Avg=4304.41, 90=3757, 99=8799, 99.9=496895, 99.99=818687] 
2022-04-27 07:00:54:970 160 sec: 3987657 operations; 29009.9 current ops/sec; est completion in 41 seconds [INSERT: Count=290085, Max=989183, Min=274, Avg=3078.34, 90=3669, 99=7839, 99.9=89599, 99.99=868351] 
2022-04-27 07:01:04:970 170 sec: 4237685 operations; 25002.8 current ops/sec; est completion in 31 seconds [INSERT: Count=250018, Max=650239, Min=276, Avg=2677.93, 90=4007, 99=8935, 99.9=115199, 99.99=648703] 
2022-04-27 07:01:14:971 180 sec: 4473187 operations; 23550.2 current ops/sec; est completion in 22 seconds [INSERT: Count=235490, Max=20767, Min=272, Avg=1007.42, 90=2419, 99=7263, 99.9=9591, 99.99=10679] 
2022-04-27 07:01:24:970 190 sec: 4737685 operations; 26449.8 current ops/sec; est completion in 11 seconds [INSERT: Count=264511, Max=640511, Min=276, Avg=2634.01, 90=4047, 99=8807, 99.9=142847, 99.99=638975] 
2022-04-27 07:01:34:970 200 sec: 4987686 operations; 25000.1 current ops/sec; est completion in 1 second [INSERT: Count=250000, Max=353279, Min=250, Avg=2286.9, 90=3939, 99=8359, 99.9=151039, 99.99=352767] 
2022-04-27 07:01:38:105 203 sec: 5000000 operations; 3927.91 current ops/sec; [CLEANUP: Count=100, Max=2217983, Min=0, Avg=22171.44, 90=3, 99=15, 99.9=2217983, 99.99=2217983] [INSERT: Count=12302, Max=415743, Min=298, Avg=5617.33, 90=5367, 99=13079, 99.9=414463, 99.99=415743] 
[OVERALL], RunTime(ms), 203135
[OVERALL], Throughput(ops/sec), 24614.172840721687
[TOTAL_GCS_PS_Scavenge], Count, 176
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 569
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.2801092869274128
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 176
[TOTAL_GC_TIME], Time(ms), 569
[TOTAL_GC_TIME_%], Time(%), 0.2801092869274128
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 22171.44
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 2217983
[CLEANUP], 95thPercentileLatency(us), 5
[CLEANUP], 99thPercentileLatency(us), 15
[INSERT], Operations, 5000000
[INSERT], AverageLatency(us), 2408.7771658
[INSERT], MinLatency(us), 250
[INSERT], MaxLatency(us), 1487871
[INSERT], 95thPercentileLatency(us), 4927
[INSERT], 99thPercentileLatency(us), 8671
[INSERT], Return=OK, 5000000